#alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don't much care where ——" said Alice.\n"Then it doesn't matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you're sure to do that," said the Cat, "if you only walk long enough."'
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n"'
                       'That depends a good deal on where you want to get to," said the Cat.\n"'
                       'I don\'t much care where ——" said Alice.\n"'
                       'Then it doesn\'t matter which way you go," said the Cat.\n"'
                       '—— so long as I get somewhere," Alice added as an explanation.\n'
                       'Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')

print(alice_in_wonderland)

print('----------------------------------')

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
    
"""


# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# Площа Чорного моря:
first_area = 436402
# Площа Азовського моря моря:
second_area = 37800
# Отже, разом Чорне та Азовське моря займають площу:

third_area = first_area + second_area

print(f'Площа яку займають Чорне та Азовське моря разом становить {third_area} км2' )

print('----------------------------------')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

# На з складах всього розміщено 375 291 товарів:

all_stocks = 375291

# Кількість товарів на першому та другому складах:

both_stocks12 = 250449

# Кількість товарів на другому та третьому складах:

both_stocks23 = 222950

# Знаючи кількість товарів на першому та другому складах можемо вирохувати кільуість товарів
# на третьому складі:

third_stocks = all_stocks - both_stocks12

# Знаючи кількість товарів на другому та третьому складах можемо вирохувати кільуість товарів
# на першому складі:

first_stocks = all_stocks - both_stocks23

# Знаючи кількість товарів на першому та третьому складах можемо вирохувати кільуість товарів
# на другому складі:

second_stocks = all_stocks - (first_stocks + third_stocks)

print(f'На прешому складі: {first_stocks} товарів. На другому складі: {second_stocks}  товарів. На третьому складі: {third_stocks}  товарів .')

print('----------------------------------')


# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
#  Кількість місяців, протягом яких будуть відбуватися платежі:

number_months = 18

# Щоомісячна плата за компютер:

one_cost = 1179

# Щоб знайти вартість комп'ютера, потрібно помножити щомісячну
# плату на кількість місяців, протягом яких будуть відбуватися платежі:

pc_cost = number_months * one_cost

print(f'Вартість комп’ютера {pc_cost} грн')

print('----------------------------------')
# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
first_rez = 8019 % 8
second_rez = 9907 % 9
third_rez = 2789 % 5
fourth_rez = 7248 % 6
fifth_rez = 7128 % 5
sixth_rez = 19224 % 9

print(f'Остача a:{first_rez}, остача b:{second_rez}, остача c:{third_rez}, остача d:{fourth_rez} остача e:{fifth_rez} остача f:{sixth_rez} ')

print('----------------------------------')
# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
# Щоб знайти загальну вартість замовлення, потрібно помножити кількість кожного
# товару на його ціну і скласти всі отримані результати:
# Піца велика:

big_pizza = 274 * 4

# Піца середня:

middle_pizza = 218 * 2

# Сік:

normal_juce = 35 * 4

# Торт:

normal_cacke = 350 * 1

# Вода:

normal_water = 21 * 3

# Тепер складемо всі ці суми:

birthday_cost = big_pizza + middle_pizza + normal_juce + normal_cacke + normal_water

print(f'Іринці для данного замовлення знадобиться:{birthday_cost} грн.')

print('----------------------------------')

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# Щоб дізнатися, скільки сторінок знадобиться Ігорю, потрібно поділити загальну кількість фотографій
# на кількість фотографій, які можуть бути розміщені на одній сторінці.
#Ігор має 232 фотографії, і на одній сторінці можна розмістити 8 фотографій:

number_pages = 232 // 8

print(f'Ігорю знадобиться {number_pages} сторінок альбому, щоб вклеїти всі фото?')

print('----------------------------------')

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
# Відстань між цими містами становить 1600 км.Тому:

my_distance = 1600

# Місткість баку становить 48 літрів.Тому:

my_tank = 48

# На кожні 100 км автомобіль споживає 9 літрів бензину.
# Відстань між Харковом і Будапештом становить 1600 км. Спочатку знайдемо, скільки літрів бензину знадобиться для всієї подорожі:

need_litriv = (my_distance // 100 ) * 9

# Тепер знайдемо, скільки разів потрібно заправляти повний бак(рахуємо що родина вирушала у подорож з повним баком:

need_fills = need_litriv // my_tank - 1

print(f'Родині необхідно заїхати на заправку під час цієї подорожі {need_fills} рази заправляючи кожного разу повний бак?')