# Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".

# Варіант №1
my_list = []
while True:
    words = input("Введіть слово: ")
    for word in words:
        if word == 'h' or 'H' :
            my_list.append(word)
    if my_list:
        print("Дякую, ви ввели слово з літерою 'h' чи 'H'.")
        break
    else:
        print("У вашому слові немає літери 'h' чи 'H'. Спробуйте ще раз.")

# Варіант №2
while True:
    word = input("Введіть слово: ")
    if 'h' in word.lower():
        print("Дякую, ви ввели слово з літерою 'h'.")
        break
    else:
        print("У вашому слові немає літери 'h'. Спробуйте ще раз.")